app/controllers/comments_controller.rb

INSERT INTO `comments` (`content`, `created_at`, `updated_at`, `post_id`) VALUES ('comment on lll', '2020-03-26 20:07:00.637929', '2020-03-26 20:07:00.637929', 3)
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
---
  def create
    # puts params["format"]
    @comment = Post.find(params["format"]).comments.create(commentParams)

SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 7 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 7
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy