app/controllers/posts_controller.rb

  def create
    @post = Post.create(postParams)
---
INSERT INTO `posts` (`title`, `content`, `created_at`, `updated_at`) VALUES ('tttt', 'dsgfh fdghgfhg dfbgfhnj', '2020-03-26 11:23:17.352261', '2020-03-26 11:23:17.352261')

  def show

    @post = Post.find(params[:id])
    @comments = Post.find(params[:id]).comments
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 3
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1  [["id", 3], ["LIMIT", 1]]

  def update
    @post = Post.find(params[:id])

    if @post.update(postParams)
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `posts`.`title` = 'post1', `posts`.`content` = 'post1 post1 post1 post1', `posts`.`updated_at` = '2020-03-28 08:51:19.086606' WHERE `posts`.`id` = 2

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 1